stm32duino/stm32_svd/svd/STM32WBAxx/STM32WBAxx.svd
	   </registers>
    </peripheral>
    <peripheral derivedFrom="GTZC1_TZIC">
      <name>SEC_GTZC1_TZIC</name>
      <baseAddress>0x50032800</baseAddress>
    </peripheral>
	<peripheral>
        <name>GTZC1_MPCBB1</name>
        <description>GTZC1_MPCBB1 address block description</description>
		<groupName>GTZC</groupName>
        <baseAddress>0x40032C00</baseAddress>
        <addressBlock>
          <offset>0x0</offset>
          <size>0x400</size>
          <usage>registers</usage>
        </addressBlock>
        <registers>
        <register>
          <name>GTZC1_MPCBB_CR</name>
          <displayName>GTZC1_MPCBB_CR</displayName>
          <description>MPCBB control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
		  <resetMask>0xFFFFFFFF</resetMask>
          <fields>
		   <field>
                <name>GLOCK</name>
                <description>lock the control register of the MPCBB until next reset;
This bit is cleared by default and once set, it can not be reset until system reset.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>control register not locked</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>control register locked</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INVSECSTATE</name>
                <description>SRAM clocks security state;
This bit is used to define the internal SRAM clocks control in RCC as secure or not.</description>
                <bitOffset>30</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>SRAM clock is secured if a secure area exists in the MPCBB. It is non secure if there is no secure area.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>SRAM clock is non-secure even if a secure area exists in the MPCBB, and secure even if no secure block is set in the MPCBB.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRWILADIS</name>
                <description>secure read/write illegal access disable;
This bit disables the detection of an illegal access when a secure read/write transaction access a non-secure blocks of the block-based SRAM (secure fetch on non-secure block is always considered illegal).</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>enabled, secure read/write acces not allowed on non-secure SRAM block</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>disabled, secure read/write access allowed on non-secure SRAM block</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
          </fields>
        </register>
        <register>
          <name>GTZC1_MPCBB_CFGLOCK</name>
          <displayName>GTZC1_MPCBB_CFGLOCK</displayName>
          <description>GTZC1 SRAMz MPCBB configuration lock register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
		  <resetMask>0xFFFFFFFF</resetMask>
          <fields>
		    <field>
                <name>SPLCK0</name>
                <description>Security/privilege configuration lock super-block;
This bit is set by software and can be cleared only by system reset.;
note that bit [3:2] are reserved on sales type STM32WBA5xEx for MPCBB1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>GTZC1_MPCBB_SECCFGRn and GTZC1_MPCBB_PRIVCFGRn can be written.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writes to GTZC1_MPCBB_SECCFGRn and GTZC1_MPCBB_PRIVCFGRn are ignored</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPLCK1</name>
                <description>Security/privilege configuration lock super-block;
This bit is set by software and can be cleared only by system reset.;
note that bit [3:2] are reserved on sales type STM32WBA5xEx for MPCBB1.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>GTZC1_MPCBB_SECCFGRn and GTZC1_MPCBB_PRIVCFGRn can be written.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writes to GTZC1_MPCBB_SECCFGRn and GTZC1_MPCBB_PRIVCFGRn are ignored</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPLCK2</name>
                <description>Security/privilege configuration lock super-block;
This bit is set by software and can be cleared only by system reset.;
note that bit [3:2] are reserved on sales type STM32WBA5xEx for MPCBB1.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>GTZC1_MPCBB_SECCFGRn and GTZC1_MPCBB_PRIVCFGRn can be written.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writes to GTZC1_MPCBB_SECCFGRn and GTZC1_MPCBB_PRIVCFGRn are ignored</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SPLCK3</name>
                <description>Security/privilege configuration lock super-block;
This bit is set by software and can be cleared only by system reset.;
note that bit [3:2] are reserved on sales type STM32WBA5xEx for MPCBB1.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>GTZC1_MPCBB_SECCFGRn and GTZC1_MPCBB_PRIVCFGRn can be written.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writes to GTZC1_MPCBB_SECCFGRn and GTZC1_MPCBB_PRIVCFGRn are ignored</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
		  </fields>         
        </register>          
